modules_cxf_src_test_java_org_mule_runtime_module_cxf_ProxyTestCase.java/[CN]/ProxyTestCase/[MT]/testServerSoapAction()/body

{
  String msg="<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:new=\"http://new.webservice.namespace\">" + "<soapenv:Header/>" + "  <soapenv:Body>"+ "    <new:parameter1>hello world</new:parameter1>"+ "  </soapenv:Body>"+ "</soapenv:Envelope>";
  MuleMessage result=executeSoapCall(msg,"EchoOperation1","/services/routeBasedOnSoapAction");
  assertResultContains(result,"<new:parameter1");
}
