modules_cxf_src_test_java_org_mule_module_cxf_issues_ProxyMule6829TestCase.java/[CN]/ProxyMule6829TestCase/[MT]/testProxyServerSoap11()/body

{
  final Latch latch=new Latch();
  TestCxfEventCallback testCxfEventCallback=new TestCxfEventCallback(latch);
  FunctionalTestComponent testComponent=(FunctionalTestComponent)getComponent("soap11Flow");
  testComponent.setEventCallback(testCxfEventCallback);
  String msgEchoOperation1="<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:new=\"http://new.webservice.namespace\">" + "<soapenv:Header/>" + "  <soapenv:Body>"+ "    <new:parameter1>hello world</new:parameter1>"+ "  </soapenv:Body>"+ "</soapenv:Envelope>";
  String msgEchoOperation2="<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:new=\"http://new.webservice.namespace\">" + "<soapenv:Header/>" + "  <soapenv:Body>"+ "    <new:parameter2>hello world</new:parameter2>"+ "  </soapenv:Body>"+ "</soapenv:Envelope>";
  String soapOperation="EchoOperation1";
  MuleMessage response=executeSoap11Call(msgEchoOperation1,soapOperation);
  assertTrue(latch.await(1000L,TimeUnit.MILLISECONDS));
  String cxfOperationName=testCxfEventCallback.getCxfOperationName();
  assertEquals(soapOperation,cxfOperationName);
  assertTrue(getPayloadAsString(response).contains("<new:parameter1"));
  assertTrue(getPayloadAsString(response).contains("hello world"));
  soapOperation="EchoOperation2";
  response=executeSoap11Call(msgEchoOperation2,soapOperation);
  assertTrue(latch.await(1000L,TimeUnit.MILLISECONDS));
  cxfOperationName=testCxfEventCallback.getCxfOperationName();
  assertEquals(soapOperation,cxfOperationName);
  assertTrue(getPayloadAsString(response).contains("<new:parameter2"));
  assertTrue(getPayloadAsString(response).contains("hello world"));
}
